I just want to add that this happens also for ipv6, probably this is not nothing surprising, but adding this info just in case it is relevant.

```
  # module.hosting.module.lb.aws_lb.default must be replaced
-/+ resource "aws_lb" "default" {
      ~ arn                              = "xxx" -> (known after apply)
      ~ arn_suffix                       = "xxx" -> (known after apply)
      ~ dns_name                         = "xxx" -> (known after apply)
      ~ id                               = "xxx" -> (known after apply)
        name                             = "xxx"
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [
          - "subnet-0c3e0291f2393243b",
        ] -> (known after apply)
      ~ vpc_id                           = ""xxx"" -> (known after apply)
      ~ zone_id                          = ""xxx"" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ access_logs {
            # (1 unchanged attribute hidden)
        }

      - subnet_mapping { # forces replacement
          - ipv6_address = "2a05:1234:1234:1234:1234:1234:1234:1234" -> null
          - subnet_id    = "subnet-0c3e0291f2123123b" -> null
        }
      + subnet_mapping { # forces replacement
          + allocation_id = "eipalloc-01b429123123123fa"
          + ipv6_address  = "2a05:1234:1234:1234:1234:1234:1234:1234"
          + outpost_id    = (known after apply)
          + subnet_id     = "subnet-0c3e0291f2123123b"
        }
    }

````




